/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[모든 날짜]@";
"%@ %[Today]@" = "%1$@ %2$[오늘]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[어제부터]@";
"%@ %[This week]@" = "%1$@ %2$[이번 주]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[최근 2주]@";
"%@ %[This month]@" = "%1$@ %2$[이번 달]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[최근 2개월]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[모두]@";
"%@ %[Yes]@" = "%1$@ %2$[있음]@";
"%@ %[No]@" = "%1$@ %2$[없음]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[다음을 포함]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[다음 날짜부터]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[다음 날짜까지]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[다음과 같음]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[해당일]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[다음 날짜 이전]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[다음 날짜 이후]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[다음보다 큼]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[다음보다 작음]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[다음 기간 내]@ %3$@ %4$[일]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[다음 기간 내]@ %3$@ %4$[주]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[다음 기간 내]@ %3$@ %4$[개월]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[다음 기간 내]@ %3$@ %4$[년]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[색상 공간]@ %2$[모든 색상 공간]@";
"%[Color Space]@ %[RGB]@" = "%1$[색상 공간]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[색상 공간]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[색상 공간]@ %2$[흑백음영]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[콘텐츠]@ 다음을 포함 %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[실행 시간]@ %2$[다음보다 큼]@ %3$@ %4$[분]@ %5$@ %6$[초]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[실행 시간]@ %2$[다음보다 작음]@ %3$@ %4$[분]@ %5$@ %6$[초]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[키워드]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[키워드]@ 다음을 포함 %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[종류]@ 다음과 같음 %2$[모두]@";
"%[Kind]@ is %[Images]@" = "%1$[종류]@ 다음과 같음 %2$[이미지]@";
"%[Kind]@ is %[Text]@" = "%1$[종류]@ 다음과 같음 %2$[텍스트]@";
"%[Kind]@ is %[PDF]@" = "%1$[종류]@ 다음과 같음 %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[종류]@ 다음과 같음 %2$[동영상]@";
"%[Kind]@ is %[Music]@" = "%1$[종류]@ 다음과 같음 %2$[음악]@";
"%[Kind]@ is %[Documents]@" = "%1$[종류]@ 다음과 같음 %2$[도큐멘트]@";
"%[Kind]@ is %[Presentations]@" = "%1$[종류]@ 다음과 같음 %2$[프레젠테이션]@";
"%[Kind]@ is %[Folders]@" = "%1$[종류]@ 다음과 같음 %2$[폴더]@";
"%[Kind]@ is %[Applications]@" = "%1$[종류]@ 다음과 같음 %2$[응용 프로그램]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[종류]@ 다음과 같음 %2$[기타...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[꼬리표]@ 다음과 같음 %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[최근 사용일]@ %2$[모든 날짜]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[최근 수정일]@ %2$[모든 날짜]@";
"%[Created]@ %[Any Date]@" = "%1$[생성일]@ %2$[모든 날짜]@";
"%[Last Opened]@ %[Today]@" = "%1$[최근 사용일]@ %2$[오늘]@";
"%[Last Modified]@ %[Today]@" = "%1$[최근 수정일]@ %2$[오늘]@";
"%[Created]@ %[Today]@" = "%1$[생성일]@ %2$[오늘]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[최근 사용일]@ %2$[어제부터]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[최근 수정일]@ %2$[어제부터]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[생성일]@ %2$[어제부터]@";
"%[Last Opened]@ %[This week]@" = "%1$[최근 사용일]@ %2$[이번 주]@";
"%[Last Modified]@ %[This week]@" = "%1$[최근 수정일]@ %2$[이번 주]@";
"%[Created]@ %[This week]@" = "%1$[생성일]@ %2$[이번 주]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[최근 사용일]@ %2$[최근 2주]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[최근 수정일]@ %2$[최근 2주]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[생성일]@ %2$[최근 2주]@";
"%[Last Opened]@ %[This month]@" = "%1$[최근 사용일]@ %2$[이번 달]@";
"%[Last Modified]@ %[This month]@" = "%1$[최근 수정일]@ %2$[이번 달]@";
"%[Created]@ %[This month]@" = "%1$[생성일]@ %2$[이번 달]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[최근 사용일]@ %2$[최근 2개월]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[최근 수정일]@ %2$[최근 2개월]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[생성일]@ %2$[최근 2개월]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[최근 사용일]@ %2$[해당일]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[최근 수정일]@ %2$[해당일]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[생성일]@ %2$[해당일]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[최근 사용일]@ %2$[다음 날짜 이전]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[최근 수정일]@ %2$[다음 날짜 이전]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[생성일]@ %2$[다음 날짜 이전]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[최근 사용일]@ %2$[다음 날짜 이후]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[최근 수정일]@ %2$[다음 날짜 이후]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[생성일]@ %2$[다음 날짜 이후]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[최근 사용일]@ %2$[다음 기간 내]@ %3$@ %4$[일]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[최근 수정일]@ %2$[다음 기간 내]@ %3$@ %4$[일]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[생성일]@ %2$[다음 기간 내]@ %3$@ %4$[일]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[최근 사용일]@ %2$[다음 기간 내]@ %3$@ %4$[주]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[최근 수정일]@ %2$[다음 기간 내]@ %3$@ %4$[주]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[생성일]@ %2$[다음 기간 내]@ %3$@ %4$[주]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[최근 사용일]@ %2$[다음 기간 내]@ %3$@ %4$[개월]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[최근 수정일]@ %2$[다음 기간 내]@ %3$@ %4$[개월]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[생성일]@ %2$[다음 기간 내]@ %3$@ %4$[개월]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[최근 사용일]@ %2$[다음 기간 내]@ %3$@ %4$[년]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[최근 수정일]@ %2$[다음 기간 내]@ %3$@ %4$[년]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[생성일]@ %2$[다음 기간 내]@ %3$@ %4$[년]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[음악 장르]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[이름 확장자]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[이름]@ %2$[다음을 포함]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[이름]@ %2$[다음으로 시작]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[이름]@ %2$[다음으로 끝남]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[이름]@ %2$[다음과 같음]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[방향]@ %2$[모든 방향]@";
"%[Orientation]@ %[Landscape]@" = "%1$[방향]@ %2$[가로]@";
"%[Orientation]@ %[Portrait]@" = "%1$[방향]@ %2$[세로]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[기타...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[원본 질의]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[검색]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[크기]@ %2$[다음보다 큼]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[크기]@ %2$[다음보다 작음]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[크기]@ %2$[다음보다 큼]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[크기]@ %2$[다음보다 작음]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[크기]@ %2$[다음보다 큼]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[크기]@ %2$[다음보다 작음]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[가시성]@ %2$[보이는 또는 보이지 않는 항목]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[가시성]@ %2$[보이는 항목]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[가시성]@ %2$[보이지 않는 항목]@";

